#ifndef AC_NPC_SHOP_COMMON_H
#define AC_NPC_SHOP_COMMON_H

#include "types.h"
#include "ac_npc.h"
#include "m_mail_password_check.h"
#include "m_font.h"
#include "m_player_lib.h"
#include "m_monument.h"
#include "m_island.h"
#include "libultra/libultra.h"
#include "_mem.h"
#include "m_ledit_ovl.h"

#ifdef __cplusplus
extern "C" {
#endif

#define aNSC_MAX_TICKETS 255
#define aNSC_BZ_MONUMENT_COUNT (mMM_MONUMENT_MAX_PER_ACRE * 5) // (15)
#define aNSC_BX_MONUMENT_COUNT (5)
// I *think* this is how they got this size,
// since 3 * 30 = 90, 90 * 8 = 720/0x2D0 bytes.
#define aNSC_MONUMENT_COUNT (mMM_MONUMENT_MAX_PER_ACRE * FG_BLOCK_TOTAL_NUM)

#define aNSC_PW_TOWN_STR_LEN LAND_NAME_SIZE
#define aNSC_PW_RECIP_STR_LEN PLAYER_NAME_LEN

#define SELL_BUY_RATIO 4
#define aNSC_LOAN_MEDIUM 125000
#define aNSC_LOAN_LARGE 298000
#define aNSC_LOAN_UPPER 598000
#define aNSC_LOAN_STATUE 0
#define aNSC_LOAN_BASEMENT 249000
#define aNSC_LOAN_ISLAND 998000

#define aNSC_PLAYER_DISTANCE (f32)60.0

enum aNSC_action {
    aNSC_ACTION_START_WAIT,
    aNSC_ACTION_SAY_HELLO_APPROACH,
    aNSC_ACTION_SAY_HELLO_END_WAIT,
    aNSC_ACTION_03_SAY_HELLO_END_WAIT,
    aNSC_ACTION_SAY_HELLO_APPROACH_ISLAND, // NEW
    aNSC_ACTION_INPUT_ISLAND_NAME_START_WAIT, // NEW
    aNSC_ACTION_INPUT_ISLAND_NAME_MENU_OPEN_WAIT, // NEW
    aNSC_ACTION_INPUT_ISLAND_NAME_MENU_CLOSE_WAIT, // NEW
    aNSC_ACTION_MSG_WIN_OPEN_WAIT3, // NEW
    aNSC_ACTION_CHECK_ISLAND_NAME, // NEW
    aNSC_ACTION_SAY_HELLO_APPROACH_STATUE, // NEW
    aNSC_ACTION_CHECK_STATUE_ORDER, // NEW
    aNSC_ACTION_CHECK_STATUE_ORDER2, // NEW
    aNSC_ACTION_CHECK_ROOF_COL_ORDER,
    aNSC_ACTION_CHECK_ROOF_COL_ORDER2,
    aNSC_ACTION_CHECK_COL_CHG_OR_MAKE_BASEMENT,
    aNSC_ACTION_PRESENT_BALLOON_START_WAIT,
    aNSC_ACTION_PRESENT_BALLOON_TRANS_MOVE,
    aNSC_ACTION_PRESENT_BALLOON_TRANS_TAKEOUT,
    aNSC_ACTION_PRESENT_BALLOON_TRANS_WAIT,
    aNSC_ACTION_PRESENT_BALLOON_END_WAIT,
    aNSC_ACTION_REQUEST_Q_START_WAIT,
    aNSC_ACTION_REQUEST_Q_ANSWER_WAIT,
    aNSC_ACTION_REQUEST_Q_END_WAIT,
    aNSC_ACTION_ANSWER_BUY_ITEM,
    aNSC_ACTION_BUY_MENU_OPEN_WAIT,
    aNSC_ACTION_BUY_MENU_CLOSE_WAIT,
    aNSC_ACTION_MSG_WIN_OPEN_WAIT,
    aNSC_ACTION_BUY_SUM_CHECK,
    aNSC_ACTION_BUY_CHECK,
    aNSC_ACTION_BUY_AFTER_SERVICE,
    aNSC_ACTION_BUY_CONTINUE_CHECK,
    aNSC_ACTION_RECEIVE_CHECK,
    aNSC_ACTION_19_ANSWER_BUY_ITEM,
    aNSC_ACTION_0x1a_UNUSED,
    aNSC_ACTION_0x1b_UNUSED,
    aNSC_ACTION_MSG_WIN_OPEN_WAIT2,
    aNSC_ACTION_ORDER_CHECK,
    aNSC_ACTION_SELL_CHECK_BEFORE,
    aNSC_ACTION_SELL_CHECK,
    aNSC_ACTION_SELL_ANSWER0,
    aNSC_ACTION_21_REQUEST_Q_END_WAIT,
    aNSC_ACTION_SELL_ITEM_WITHOUT_TICKET,
    aNSC_ACTION_SELL_ITEM_WITH_TICKET,
    aNSC_ACTION_SELL_ITEM_POCKETS_FULL,
    aNSC_ACTION_SELL_ITEM_INSUFICIENT_FUNDS,
    aNSC_ACTION_SHOW_ITEM_CHECK,
    aNSC_ACTION_CHG_CLOTH_START_WAIT,
    aNSC_ACTION_CHG_CLOTH_END_WAIT,
    aNSC_ACTION_REQUEST_Q_PW_ANSWER_WAIT, // NEW
    aNSC_ACTION_PW_ENTRY_SEND_ADDR_START_WAIT,
    aNSC_ACTION_2A_BUY_MENU_OPEN_WAIT,
    aNSC_ACTION_0x2b_UNUSED,
    aNSC_ACTION_PW_MSG_WIN_OPEN_WAIT,
    aNSC_ACTION_PW_SEND_ADDR_CHECK,
    aNSC_ACTION_PW_SEL_ITEM_START_WAIT,
    aNSC_ACTION_2F_BUY_MENU_OPEN_WAIT,
    aNSC_ACTION_0x30_UNUSED,
    aNSC_ACTION_0x31_UNUSED,
    aNSC_ACTION_PW_SEND_CHECK,
    aNSC_ACTION_PW_RETRY_SEL_ITEM_CHECK,
    aNSC_ACTION_PC_INPUT_PW_START_WAIT,
    aNSC_ACTION_PC_MENU_OPEN_WAIT,
    aNSC_ACTION_PC_MENU_CLOSE_WAIT,
    aNSC_ACTION_PC_MSG_WIN_OPEN_WAIT,
    aNSC_ACTION_PC_RETRY_INPUT_PW_CHECK,
    aNSC_ACTION_PC_PRESENT_START_WAIT,
    aNSC_ACTION_PC_PRESENT_TRANS_TAKEOUT,
    aNSC_ACTION_PC_PRESENT_TRANS_WAIT,
    aNSC_ACTION_PC_PRESENT_END_WAIT,
    aNSC_ACTION_PC_REMOVE_CHK_REMOVE, // NEW
    aNSC_ACTION_MM_ORDER_REQUEST_Q_ANSWER_WAIT, // NEW
    aNSC_ACTION_MM_ORDER_SELECT_OBJ, // NEW
    aNSC_ACTION_MM_ORDER_SELECT_PLACE_Z, // NEW
    aNSC_ACTION_MM_ORDER_SELECT_PLACE_X, // NEW
    aNSC_ACTION_MM_ORDER_CHK_ORDER, // NEW
    aNSC_ACTION_MM_REMOVE_CHK_REMOVE, // NEW
    aNSC_ACTION_MS_PRESENT_START_WAIT, // NEW
    aNSC_ACTION_MS_PRESENT_TRANS_TAKEOUT, // NEW
    aNSC_ACTION_MS_PRESENT_TRANS_WAIT, // NEW
    aNSC_ACTION_WAIT,
    aNSC_ACTION_0x3e_WAIT,
    aNSC_ACTION_WALK_PL_OTHER_ZONE,
    aNSC_ACTION_0x40_WAIT,
    aNSC_ACTION_0x41_WALK_PL_OTHER_ZONE,
    aNSC_ACTION_TURN,
    aNSC_ACTION_GOODBYE_WAIT,
#ifdef aNSC_MAMEDANUKI
    aNSC_ACTION_GOODBYE_WAIT2,
#endif
    aNSC_ACTION_SAY_GOODBYE,
    aNSC_ACTION_EXIT_WAIT,

    aNSC_ACTION_NUM
};

enum aNSC_msg_no {
    aNSC_MSG_WAIT = -0x1,
    aNSC_MSG_REHOUSE_MEDIUM = 0x0,
    aNSC_MSG_REHOUSE_MEDIUM_1,
    aNSC_MSG_REHOUSE_MEDIUM_2,
    aNSC_MSG_MEDIUM_BUILT,
    aNSC_MSG_REHOUSE_2_OFFER,
    aNSC_MSG_REHOUSE_2_LARGe,
    aNSC_MSG_REHOUSE_2_BASEment,
    aNSC_MSG_LARGE_BUILT,
    aNSC_MSG_REHOUSE_STATUE,
    aNSC_MSG_STATUE_BUILT,
    aNSC_MSG_PALLET_SELECTED,
    aNSC_MSG_PALLET_SELECT_1,
    aNSC_MSG_PALLET_SELECT_2,
    aNSC_MSG_PALLET_SELECT_3,
    aNSC_MSG_PALLET_SELECT_4,
    aNSC_MSG_OFFER_SELL_ALL,
    aNSC_MSG_EVENT_DEPART,
    aNSC_MSG_GREET_DEPART,
    aNSC_MSG_SHOW_CLOTH,
    aNSC_MSG_CONFIRM_CLOTH,
    aNSC_MSG_CANCEL_CLOTH,
    aNSC_MSG_CANCEL,
    aNSC_MSG_START_CALL_NORMAL,
    aNSC_MSG_INTERACT_START,
    aNSC_MSG_INTERACT_CANCEL,
    aNSC_MSG_KABU_INFO,
    aNSC_MSG_SELL_START,
    aNSC_MSG_SELL_OFFER,
    aNSC_MSG_SELL_NORMAL,
    aNSC_MSG_SELL_CANCEL,
    aNSC_MSG_BUY_ONE_OFFER,
    aNSC_MSG_BUY_CANCEL,
    aNSC_MSG_THANKS,
    aNSC_MSG_INSUFFICIENT_FUNDS,
    aNSC_MSG_BUY_NORMAL,
    aNSC_MSG_SAY_GOODBYE,
    aNSC_MSG_KABU_ON_SUNDAY,
    aNSC_MSG_EVENT,
    aNSC_MSG_BREAK_BAG,
    aNSC_MSG_POCKETS_FULL,
    aNSC_MSG_SHOW_ITEM,
    aNSC_MSG_SHOW_CARPET_OFFER,
    aNSC_MSG_SHOW_CARPET_DECLINE,
    aNSC_MSG_SHOW_CATALOGUE,
    aNSC_MSG_ORDER_OFFER,
    aNSC_MSG_ORDER_UNAVAILABLE,
    aNSC_MSG_ORDER_CANCEL,
    aNSC_MSG_ORDER_CONFIRM,
    aNSC_MSG_ORDER_INSUFFICIENT_FUNDS,
    aNSC_MSG_ORDER_FULL,
    aNSC_MSG_ORDER_FURNITURE_ONLY,
    aNSC_MSG_GIVE_TICKET,
    aNSC_MSG_MAIL_TICKET,
    aNSC_MSG_TICKET_1,
    aNSC_MSG_TICKET_2,
    aNSC_MSG_TICKET_SELL_REFUSE,
    aNSC_MSG_SELL_QUEST,
    aNSC_MSG_JUNK_ACCEPT,
    aNSC_MSG_JUNK_CANCEL,
    aNSC_MSG_3B,
    aNSC_MSG_3C,
    aNSC_MSG_3D,
    aNSC_MSG_3E,
    aNSC_MSG_3F,
    aNSC_MSG_SELL_SHOVEL = 0x64,
    aNSC_MSG_SELL_NET,
    aNSC_MSG_SELL_ROD,
    aNSC_MSG_SELL_AXE,
    aNSC_MSG_SELL_SIGN,
    aNSC_MSG_MONEY_OVERFLOW = 0xc8,
    aNSC_MSG_SELL_PAINT = 0xca,
    aNSC_MSG_SELL_PAINT_CONFIRM,
    aNSC_MSG_BASEMENT_BUILT,
    aNSC_MSG_BASEMENT_PAID,
    aNSC_MSG_REHOUSE_BASEMENT = 0xd0,
    aNSC_MSG_REHOUSE_LARGE,
    aNSC_MSG_REHOUSE_UPPER = 0xd4,
    aNSC_MSG_UPPER_BUILT,
    aNSC_MSG_BUY_MANY_OFFER,
    aNSC_MSG_BUY_REFUSE_PLURAL = 0xd8,
    aNSC_MSG_BALLOON = 0xda,
    aNSC_MSG_BALLOON_DEPART = 0xdc,
    aNSC_MSG_SELL_PAPER = 0xde,
    aNSC_MSG_SELL_PAINT_FOREIGN,
    aNSC_MSG_REHOUSE_ISLAND = 0xe3,
    aNSC_MSG_PSWD_NO_ITEM = 0x12c,
    aNSC_MSG_PSWD_INFO = 0x12d,
    aNSC_MSG_PSWD_SAME_NAME,
    aNSC_MSG_PSWD_CONFIRM,
    aNSC_MSG_PSWD_CANCEL = 0x131,
    aNSC_MSG_PSWD_CHECK,
    aNSC_MSG_PSWD_NO_ITEM2 = 308,
    aNSC_MSG_OTHER = 0x135,
    aNSC_MSG_RETURN,
    aNSC_MSG_PSWD_INVENTORY_FULL,
    aNSC_MSG_PSWD_SAY,
    aNSC_MSG_PSWD_WRONG,
    aNSC_MSG_PSWD_DECLINE,
    aNSC_MSG_PSWD_GOOD_FAMICON,
    aNSC_MSG_PSWD_GOOD_NPC,
    aNSC_MSG_PSWD_GOOD_MAGAZINE_1,
    aNSC_MSG_PSWD_CARDE,
    aNSC_MSG_PSWD_GOOD_USER,
    aNSC_MSG_PSWD_GOOD_CARDEM,
    aNSC_MSG_PSWD_FOREIGN,
    aNSC_MSG_PSWD_GOOD_MAGAZINE_2,
    aNSC_MSG_GIFT_OUT,
    aNSC_MSG_PSWD_BAD,
    aNSC_MSG_PSWD_GOOD_NEW_NPC = 0x145,
    aNSC_MSG_PSWD_MONUMENT_ORDER = 0x148,
    aNSC_MSG_PSWD_MONUMENT_NO_SPACE,
    aNSC_MSG_PSWD_MONUMENT_NO_MONEY = 0x190,
    aNSC_MSG_PSWD_MONUMENT_ORDER_PENDING,
    aNSC_MSG_MM_ORDER_FOREIGN = 0x192,
    aNSC_MSG_MM_ORDER = 0x193,
    aNSC_MSG_MM_CANT_ORDER = 0x194,
    aNSC_MSG_MM_HAS_ORDER,
    aNSC_MSG_MM_NEW_ORDER,
    aNSC_MSG_MM_SELECT_ROW,
    aNSC_MSG_MM_NO_MONEY,
    aNSC_MSG_MM_ORDER_CHECK,
    aNSC_MSG_MM_ORDER_CHECK2,
    aNSC_MSG_MM_REMOVE_EMPTY = 0x19C,
    aNSC_MSG_MM_REMOVE_START,
    aNSC_MSG_MM_REMOVE_CANCEL,
    aNSC_MSG_MM_REMOVE_DONE,
    aNSC_MSG_MM_RETURN = 0x1A1,
    aNSC_MSG_PSWD_MONUMENT_SELECT_PLACE = 0x1A2,
    aNSC_MSG_MM_PC_REMOVE_CANCEL,
    aNSC_MSG_MM_PC_REMOVE_DONE,

    aNSC_MSG_GRP_MIDNIGHT = 500,
    aNSC_MSG_GRP_MIDNIGHT_START_CALL = aNSC_MSG_GRP_MIDNIGHT,
    aNSC_MSG_GRP_MIDNIGHT_GREET,
    aNSC_MSG_GRP_MIDNIGHT_REQUEST_END,
    aNSC_MSG_GRP_MIDNIGHT_SELL,
    aNSC_MSG_GRP_MIDNIGHT_KABU_INFO,
    aNSC_MSG_GRP_MIDNIGHT_SELL_FREE,
    aNSC_MSG_GRP_MIDNIGHT_SELL_MANY,
    aNSC_MSG_GRP_MIDNIGHT_SELL_FREE_ACCEPT,
    aNSC_MSG_GRP_MIDNIGHT_SELL_FREE_DECLINE,
    aNSC_MSG_GRP_MIDNIGHT_SELL_CONFIRM,
    aNSC_MSG_GRP_MIDNIGHT_SELL_ALL_CONFIRM,
    aNSC_MSG_GRP_MIDNIGHT_SELL_DECLINE,
    aNSC_MSG_GRP_MIDNIGHT_SELL_POCKETS_FULL,
    aNSC_MSG_GRP_MIDNIGHT_SELL_WALLET_FULL,
    aNSC_MSG_GRP_MIDNIGHT_SELL_COMPLETE,
    aNSC_MSG_GRP_MIDNIGHT_REQUEST_Q_END,
    aNSC_MSG_GRP_MIDNIGHT_SELL_FREE2,
    aNSC_MSG_GRP_MIDNIGHT_SELL_QUEST_ITEM,
    aNSC_MSG_GRP_MIDNIGHT_BUY_ONE_OFFER,
    aNSC_MSG_GRP_MIDNIGHT_BUY_DECLINE,
    aNSC_MSG_GRP_MIDNIGHT_BUY_FINISH,
    aNSC_MSG_GRP_MIDNIGHT_BUY_POCKETS_FULL,
    aNSC_MSG_GRP_MIDNIGHT_BUY_NOT_ENOUGH_BELLS,
    aNSC_MSG_GRP_MIDNIGHT_BUY_COMPLETE,
    aNSC_MSG_GRP_MIDNIGHT_SELL_PAINT_FOREIGN,
    aNSC_MSG_GRP_MIDNIGHT_SELL_PAINT,
    aNSC_MSG_GRP_MIDNIGHT_26,
    aNSC_MSG_GRP_MIDNIGHT_27,
    aNSC_MSG_GRP_MIDNIGHT_28,
    aNSC_MSG_GRP_MIDNIGHT_29,
    aNSC_MSG_GRP_MIDNIGHT_30,
    aNSC_MSG_GRP_MIDNIGHT_31,
    aNSC_MSG_GRP_MIDNIGHT_32,
};

enum aNSC_wait_type {

    aNSC_WAIT_TYPE_REHOUSE,
    aNSC_WAIT_TYPE_DONE_REHOUSE,
    aNSC_WAIT_TYPE_BALLOON,
    aNSC_WAIT_TYPE_3,
    aNSC_WAIT_TYPE_HRATALK,
    aNSC_WAIT_TYPE_FORCE_OPEND,
    aNSC_WAIT_TYPE_TOWN_LENT,

    aNSC_WAIT_TYPE_NUM
};

enum aNSC_buy_outcome {
    aNSC_BUY_OUTCOME_BREAK_BAG,
    aNSC_BUY_OUTCOME_NORMAL,
    aNSC_BUY_OUTCOME_CANCEL,
    aNSC_BUY_OUTCOME_MONEY_OVERFLOW,  
    aNSC_BUY_OUTCOME_NUM
};

enum aNSC_check_buy {
    aNSC_CHECK_BUY_NORMAL_SUB,
    aNSC_CHECK_BUY_NONE_SELECTED,
    aNSC_CHECK_BUY_NO_SUNDAY_TURNIPS,
    aNSC_CHECK_BUY_REFUSE_QUEST_COND,
    aNSC_CHECK_BUY_TAKE_OFF_HANDS,
    aNSC_CHECK_BUY_OFFER_BUY_ALL,
    aNSC_CHECK_BUY_PLURAL,
    aNSC_CHECK_BUY_NORMAL,

    aNSC_RES_NUM
};

enum aNSC_tanni_str {
    aNSC_TANNI_STR_00,
    aNSC_TANNI_STR_COMMOD,
    aNSC_TANNI_STR_CLOTH,
    aNSC_TANNI_03,
    aNSC_TANNI_STR_KABU,
    aNSC_TANNI_STR_FAUNA,
    aNSC_TANNI_STR_SAPPLING,
    aNSC_TANNI_STR_DIARY,
    aNSC_TANNI_STR_08,
    aNSC_TANNI_STR_09,

    aNSC_TANNI_STR_NUM
};

enum check_password_result {
    aNSC_PSW_RES_0,
    aNSC_PSW_GOOD_FAMICON,
    aNSC_PSW_GOOD_NPC,
    aNSC_PSW_GOOD_MAGAZINE_1,
    aNSC_PSW_CARDE = 4,
    aNSC_PSW_GOOD_USER,
    aNSC_PSW_GOOD_CARDEM,
    aNSC_PSW_GOOD_MAGAZINE_2,
    aNSC_PSW_BAD = 8,
    aNSC_PSW_RES_9 = 9,
    aNSC_PSW_GOOD_NEW_NPC,
    aNSC_PSW_GOOD_MONUMENT,
    aNSC_PSW_MONUMENT_ORDER,
    aNSC_PSW_MONUMENT_NO_SPACE,
    aNSC_PSW_MONUMENT_SELECT_PLACE,
    aNSC_PSW_MONUMENT_NO_MONEY,
    aNSC_PSW_MONUMENT_ORDER_PENDING,

    aNSC_PSW_NUM
};

enum aNSC_request_show_type {
    aNSC_REQUEST_SHOW_TYPE_WALL,
    aNSC_REQUEST_SHOW_TYPE_CARPET
};

enum {
    aNSC_DAY_NORMAL,
    aNSC_DAY_FUKUBIKI,

    aNSC_DAY_NUM
};

typedef struct aNSC_animation_data_s {
    int anim;
    int talk_flag;
} aNSC_animation_data;

typedef struct npc_shop_common_actor_s NPC_SHOP_COMMON_ACTOR;

typedef void (*aNSC_PROC)(ACTOR*, GAME*);

typedef void (*aNSC_INIT_PROC)(NPC_SHOP_COMMON_ACTOR*, GAME_PLAY*);
typedef int (*aNSC_PC_CHECK_PASSWORD_PROC)(mMpswd_password_c*, NPC_SHOP_COMMON_ACTOR*);
typedef void (*aNSC_ITEM_SELL_PROC)(NPC_SHOP_COMMON_ACTOR*, mActor_name_t);
typedef void (*aNSC_ACTION_PROC)(NPC_SHOP_COMMON_ACTOR*, GAME_PLAY*);
typedef void (*aNSC_TALK_PROC)(NPC_SHOP_COMMON_ACTOR*, GAME_PLAY*);
typedef void (*aNSC_TALK_REQ_PROC)(NPC_SHOP_COMMON_ACTOR*, PLAYER_ACTOR*);

struct npc_shop_common_actor_s {
    /* 0x000 */ NPC_ACTOR npc_class;
    /* 0xB68 */ int action;
    /* 0xB6C */ int next_action;
    /* 0xB70 */ aNSC_ACTION_PROC proc;
    /* 0xB74 */ u16 _B74;
    /* 0xB76 */ u8 zone;
    /* 0xB77 */ u8 next_zone;
    /* 0xB78 */ u8 player_zone;
    /* 0xB79 */ u8 sale_type;
    /* 0xB7A */ s16 player_angle;
    /* 0xB7C */ u32 money;
    /* 0xB80 */ u32 value;
    /* 0xB84 */ u32 counter;
    /* 0xB88 */ mActor_name_t sell_item;
    /* 0xB8A */ u8 ut_x;
    /* 0xB8B */ u8 ut_z;
    /* 0xB8C */ u8 is_selling;
    /* 0xB8D */ u8 _9B9;
    /* 0xB8E */ mActor_name_t order_item;
    /* 0xB90 */ u16 player_cloth;
    /* 0xB92 */ u16 change_cloth;
    /* 0xB94 */ int talk_start_tim;
    /* 0xB98 */ int msg_no;
    /* 0xB9C */ u8 pw_town_str[aNSC_PW_TOWN_STR_LEN];
    /* 0xBA2 */ u8 pw_recip_str[aNSC_PW_RECIP_STR_LEN];
    /* 0xBA8 */ u8 password_str[mMpswd_PASSWORD_STR_LEN];
    /* 0xBC8 */ u16 pw_item;
    /* 0xBCA */ u16 password_flags;
    /* 0xBCC */ mMpswd_password_c password;
    /* 0xBF4 */ mMM_order_c monument_locations[aNSC_MONUMENT_COUNT];
    /* 0xEC4 */ int monument_location_cnt;
    /* 0xEC8 */ mMM_order_c monument_order;
    /* 0xED0 */ mActor_name_t live_music;
    /* 0xED2 */ Submenu_Item_c selected_items[mPr_POCKETS_SLOT_COUNT];
    /* 0xF0E */ s16 selected_item_num;
    /* 0xF10 */ int _F10;
};

#ifdef __cplusplus
}
#endif

#endif
